Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
/*! @name SEC_CLK_CTRL - Security Clock Control */
/*! @{ */

#define SYSCON0_SEC_CLK_CTRL_GDET0_REFCLK_EN_MASK (0x1U)
#define SYSCON0_SEC_CLK_CTRL_GDET0_REFCLK_EN_SHIFT (0U)
/*! GDET0_REFCLK_EN - GDET0 Reference Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_SEC_CLK_CTRL_GDET0_REFCLK_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_GDET0_REFCLK_EN_SHIFT)) & SYSCON0_SEC_CLK_CTRL_GDET0_REFCLK_EN_MASK)

#define SYSCON0_SEC_CLK_CTRL_TRNG_REFCLK_EN_MASK (0x4U)
#define SYSCON0_SEC_CLK_CTRL_TRNG_REFCLK_EN_SHIFT (2U)
/*! TRNG_REFCLK_EN - True Random Number Generator (TRNG) Reference Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_SEC_CLK_CTRL_TRNG_REFCLK_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_TRNG_REFCLK_EN_SHIFT)) & SYSCON0_SEC_CLK_CTRL_TRNG_REFCLK_EN_MASK)

#define SYSCON0_SEC_CLK_CTRL_ELS_CLK_EN_MASK     (0x8U)
#define SYSCON0_SEC_CLK_CTRL_ELS_CLK_EN_SHIFT    (3U)
/*! ELS_CLK_EN - EdgeLock Secure Subsystem (ELS) Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_SEC_CLK_CTRL_ELS_CLK_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_ELS_CLK_EN_SHIFT)) & SYSCON0_SEC_CLK_CTRL_ELS_CLK_EN_MASK)

#define SYSCON0_SEC_CLK_CTRL_ITRC_CLK_EN_MASK    (0x10U)
#define SYSCON0_SEC_CLK_CTRL_ITRC_CLK_EN_SHIFT   (4U)
/*! ITRC_CLK_EN - Intrusion and Tamper Response Controller (ITRC) Reference Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_SEC_CLK_CTRL_ITRC_CLK_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_ITRC_CLK_EN_SHIFT)) & SYSCON0_SEC_CLK_CTRL_ITRC_CLK_EN_MASK)
/*! @} */

/*! @name SEC_CLK_CTRL_SET - Security Clock Control Set */
/*! @{ */

#define SYSCON0_SEC_CLK_CTRL_SET_GDET0_REFCLK_EN_SET_MASK (0x1U)
#define SYSCON0_SEC_CLK_CTRL_SET_GDET0_REFCLK_EN_SET_SHIFT (0U)
/*! GDET0_REFCLK_EN_SET - GDET0 Reference Clock Enable Set
 *  0b0..Has no effect
 *  0b1..Sets SEC_CLK_CTRL[GDET0_REFCLK_EN] to 1
 */
#define SYSCON0_SEC_CLK_CTRL_SET_GDET0_REFCLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_SET_GDET0_REFCLK_EN_SET_SHIFT)) & SYSCON0_SEC_CLK_CTRL_SET_GDET0_REFCLK_EN_SET_MASK)

#define SYSCON0_SEC_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_MASK (0x4U)
#define SYSCON0_SEC_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_SHIFT (2U)
/*! TRNG_REFCLK_EN_SET - TRNG Reference Clock Enable Set
 *  0b0..Has no effect
 *  0b1..Sets SEC_CLK_CTRL[TRNG_REFCLK_EN] to 1
 */
#define SYSCON0_SEC_CLK_CTRL_SET_TRNG_REFCLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_SHIFT)) & SYSCON0_SEC_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_MASK)

#define SYSCON0_SEC_CLK_CTRL_SET_ELS_CLK_EN_SET_MASK (0x8U)
#define SYSCON0_SEC_CLK_CTRL_SET_ELS_CLK_EN_SET_SHIFT (3U)
/*! ELS_CLK_EN_SET - ELS Clock Enable Set
 *  0b0..Has no effect
 *  0b1..Sets SEC_CLK_CTRL[ELS_CLK_EN] to 1
 */
#define SYSCON0_SEC_CLK_CTRL_SET_ELS_CLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_SET_ELS_CLK_EN_SET_SHIFT)) & SYSCON0_SEC_CLK_CTRL_SET_ELS_CLK_EN_SET_MASK)

#define SYSCON0_SEC_CLK_CTRL_SET_ITRC_CLK_EN_SET_MASK (0x10U)
#define SYSCON0_SEC_CLK_CTRL_SET_ITRC_CLK_EN_SET_SHIFT (4U)
/*! ITRC_CLK_EN_SET - ITRC Clock Enable Set
 *  0b0..Has no effect
 *  0b1..Sets SEC_CLK_CTRL[ITRC_CLK_EN] to 1
 */
#define SYSCON0_SEC_CLK_CTRL_SET_ITRC_CLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_SET_ITRC_CLK_EN_SET_SHIFT)) & SYSCON0_SEC_CLK_CTRL_SET_ITRC_CLK_EN_SET_MASK)
/*! @} */

/*! @name SEC_CLK_CTRL_CLR - Security Clock Control Clear */
/*! @{ */

#define SYSCON0_SEC_CLK_CTRL_CLR_GDET0_REFCLK_EN_CLR_MASK (0x1U)
#define SYSCON0_SEC_CLK_CTRL_CLR_GDET0_REFCLK_EN_CLR_SHIFT (0U)
/*! GDET0_REFCLK_EN_CLR - GDET0 Reference Clock Enable Clear
 *  0b0..Has no effect
 *  0b1..Clears SEC_CLK_CTRL[GDET0_REFCLK_EN] to 0
 */
#define SYSCON0_SEC_CLK_CTRL_CLR_GDET0_REFCLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_CLR_GDET0_REFCLK_EN_CLR_SHIFT)) & SYSCON0_SEC_CLK_CTRL_CLR_GDET0_REFCLK_EN_CLR_MASK)

#define SYSCON0_SEC_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_MASK (0x4U)
#define SYSCON0_SEC_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_SHIFT (2U)
/*! TRNG_REFCLK_EN_CLR - TRNG Reference Clock Enable Clear
 *  0b0..Has no effect
 *  0b1..Clears SEC_CLK_CTRL[TRNG_REFCLK_EN] to 0
 */
#define SYSCON0_SEC_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_SHIFT)) & SYSCON0_SEC_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_MASK)

#define SYSCON0_SEC_CLK_CTRL_CLR_ELS_CLK_EN_CLR_MASK (0x8U)
#define SYSCON0_SEC_CLK_CTRL_CLR_ELS_CLK_EN_CLR_SHIFT (3U)
/*! ELS_CLK_EN_CLR - ELS Clock Enable Clear
 *  0b0..Has no effect
 *  0b1..Clears SEC_CLK_CTRL[ELS_CLK_EN] to 0
 */
#define SYSCON0_SEC_CLK_CTRL_CLR_ELS_CLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_CLR_ELS_CLK_EN_CLR_SHIFT)) & SYSCON0_SEC_CLK_CTRL_CLR_ELS_CLK_EN_CLR_MASK)

#define SYSCON0_SEC_CLK_CTRL_CLR_ITRC_CLK_EN_CLR_MASK (0x10U)
#define SYSCON0_SEC_CLK_CTRL_CLR_ITRC_CLK_EN_CLR_SHIFT (4U)
/*! ITRC_CLK_EN_CLR - ITRC Clock Enable Clear
 *  0b0..Has no effect
 *  0b1..Clears SEC_CLK_CTRL[ITRC_CLK_EN] to 0
 */
#define SYSCON0_SEC_CLK_CTRL_CLR_ITRC_CLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_CLK_CTRL_CLR_ITRC_CLK_EN_CLR_SHIFT)) & SYSCON0_SEC_CLK_CTRL_CLR_ITRC_CLK_EN_CLR_MASK)
/*! @} */

/*! @name GDET_CTRL - GDET0 Control */
/*! @{ */

#define SYSCON0_GDET_CTRL_GDET_EVTCNT_CLR_MASK   (0x1U)
#define SYSCON0_GDET_CTRL_GDET_EVTCNT_CLR_SHIFT  (0U)
/*! GDET_EVTCNT_CLR - GDET Event Counter Clear
 *  0b0..Not clear
 *  0b1..Clears
 */
#define SYSCON0_GDET_CTRL_GDET_EVTCNT_CLR(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_GDET_EVTCNT_CLR_SHIFT)) & SYSCON0_GDET_CTRL_GDET_EVTCNT_CLR_MASK)

#define SYSCON0_GDET_CTRL_GDET_ERR_CLR_MASK      (0x2U)
#define SYSCON0_GDET_CTRL_GDET_ERR_CLR_SHIFT     (1U)
/*! GDET_ERR_CLR - GDET Error Clear
 *  0b0..Not clear
 *  0b1..Clears
 */
#define SYSCON0_GDET_CTRL_GDET_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_GDET_ERR_CLR_SHIFT)) & SYSCON0_GDET_CTRL_GDET_ERR_CLR_MASK)

#define SYSCON0_GDET_CTRL_GDET_ISO_SW_MASK       (0xCU)
#define SYSCON0_GDET_CTRL_GDET_ISO_SW_SHIFT      (2U)
/*! GDET_ISO_SW - GDET Isolation Control
 *  0b00..Disabled
 *  0b01..Disabled
 *  0b10..Enabled
 *  0b11..Disabled
 */
#define SYSCON0_GDET_CTRL_GDET_ISO_SW(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_GDET_ISO_SW_SHIFT)) & SYSCON0_GDET_CTRL_GDET_ISO_SW_MASK)

