Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_GDET_CTRL_EVENT_CNT_MASK         (0xFF0000U)
#define SYSCON0_GDET_CTRL_EVENT_CNT_SHIFT        (16U)
/*! EVENT_CNT - Event Count Value */
#define SYSCON0_GDET_CTRL_EVENT_CNT(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_EVENT_CNT_SHIFT)) & SYSCON0_GDET_CTRL_EVENT_CNT_MASK)

#define SYSCON0_GDET_CTRL_POS_SYNC_MASK          (0x1000000U)
#define SYSCON0_GDET_CTRL_POS_SYNC_SHIFT         (24U)
/*! POS_SYNC - Positive Glitch Detection
 *  0b0..Not detected
 *  0b1..Detected
 */
#define SYSCON0_GDET_CTRL_POS_SYNC(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_POS_SYNC_SHIFT)) & SYSCON0_GDET_CTRL_POS_SYNC_MASK)

#define SYSCON0_GDET_CTRL_NEG_SYNC_MASK          (0x2000000U)
#define SYSCON0_GDET_CTRL_NEG_SYNC_SHIFT         (25U)
/*! NEG_SYNC - Negative Glitch Detection
 *  0b0..Not detected
 *  0b1..Detected
 */
#define SYSCON0_GDET_CTRL_NEG_SYNC(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_NEG_SYNC_SHIFT)) & SYSCON0_GDET_CTRL_NEG_SYNC_MASK)

#define SYSCON0_GDET_CTRL_EVENT_CLR_FLAG_MASK    (0x4000000U)
#define SYSCON0_GDET_CTRL_EVENT_CLR_FLAG_SHIFT   (26U)
/*! EVENT_CLR_FLAG - Event Counter Clear
 *  0b0..Not cleared
 *  0b1..Cleared
 */
#define SYSCON0_GDET_CTRL_EVENT_CLR_FLAG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_GDET_CTRL_EVENT_CLR_FLAG_SHIFT)) & SYSCON0_GDET_CTRL_EVENT_CLR_FLAG_MASK)
/*! @} */

/* The count of SYSCON0_GDET_CTRL */
#define SYSCON0_GDET_CTRL_COUNT                  (1U)

/*! @name NMISRC - NMI Source Select */
/*! @{ */

#define SYSCON0_NMISRC_IRQCPU0_MASK              (0xFFU)
#define SYSCON0_NMISRC_IRQCPU0_SHIFT             (0U)
/*! IRQCPU0 - The IRQ number of the interrupt that acts as the NMI for CPU0, if enabled by NMIENCPU0 */
#define SYSCON0_NMISRC_IRQCPU0(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON0_NMISRC_IRQCPU0_SHIFT)) & SYSCON0_NMISRC_IRQCPU0_MASK)

#define SYSCON0_NMISRC_NMIENCPU0_MASK            (0x80000000U)
#define SYSCON0_NMISRC_NMIENCPU0_SHIFT           (31U)
/*! NMIENCPU0 - Enables the Non-Maskable Interrupt (NMI) source selected by IRQCPU0
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_NMISRC_NMIENCPU0(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON0_NMISRC_NMIENCPU0_SHIFT)) & SYSCON0_NMISRC_NMIENCPU0_MASK)
/*! @} */

/*! @name CTIMERGLOBALSTARTEN - CTIMER Global Start Enable */
/*! @{ */

#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_MASK (0x1U)
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_SHIFT (0U)
/*! CTIMER0_CLK_EN - CTIMER0 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_SHIFT)) & SYSCON0_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_MASK)

#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_MASK (0x2U)
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_SHIFT (1U)
/*! CTIMER1_CLK_EN - CTIMER1 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_SHIFT)) & SYSCON0_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_MASK)

#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_MASK (0x4U)
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_SHIFT (2U)
/*! CTIMER2_CLK_EN - CTIMER2 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_SHIFT)) & SYSCON0_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_MASK)

#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER3_CLK_EN_MASK (0x8U)
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER3_CLK_EN_SHIFT (3U)
/*! CTIMER3_CLK_EN - CTIMER3 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER3_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_CTIMERGLOBALSTARTEN_CTIMER3_CLK_EN_SHIFT)) & SYSCON0_CTIMERGLOBALSTARTEN_CTIMER3_CLK_EN_MASK)

#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER4_CLK_EN_MASK (0x10U)
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER4_CLK_EN_SHIFT (4U)
/*! CTIMER4_CLK_EN - CTIMER4 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_CTIMERGLOBALSTARTEN_CTIMER4_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_CTIMERGLOBALSTARTEN_CTIMER4_CLK_EN_SHIFT)) & SYSCON0_CTIMERGLOBALSTARTEN_CTIMER4_CLK_EN_MASK)
/*! @} */

/*! @name FUSEACSTATUS - Fuse Access Status */
/*! @{ */

#define SYSCON0_FUSEACSTATUS_FUSE_CALIB_MASK     (0x1U)
#define SYSCON0_FUSEACSTATUS_FUSE_CALIB_SHIFT    (0U)
/*! FUSE_CALIB - Fuse Calibrate Flag
 *  0b0..Not calibrated
 *  0b1..Calibrated
 */
#define SYSCON0_FUSEACSTATUS_FUSE_CALIB(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_FUSEACSTATUS_FUSE_CALIB_SHIFT)) & SYSCON0_FUSEACSTATUS_FUSE_CALIB_MASK)

#define SYSCON0_FUSEACSTATUS_STATUS_BUSY_MASK    (0x2U)
#define SYSCON0_FUSEACSTATUS_STATUS_BUSY_SHIFT   (1U)
/*! STATUS_BUSY - OCOTP Status
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SYSCON0_FUSEACSTATUS_STATUS_BUSY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_FUSEACSTATUS_STATUS_BUSY_SHIFT)) & SYSCON0_FUSEACSTATUS_STATUS_BUSY_MASK)
/*! @} */

/*! @name AHBMATPRIO - Bus Matrix Priority */
/*! @{ */

#define SYSCON0_AHBMATPRIO_MBUS_M0_MASK          (0x3U)
#define SYSCON0_AHBMATPRIO_MBUS_M0_SHIFT         (0U)
/*! MBUS_M0 - M-Bus M0 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M0(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M0_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M0_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M1_MASK          (0xCU)
#define SYSCON0_AHBMATPRIO_MBUS_M1_SHIFT         (2U)
/*! MBUS_M1 - M-Bus M1 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M1(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M1_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M1_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M2_MASK          (0x30U)
#define SYSCON0_AHBMATPRIO_MBUS_M2_SHIFT         (4U)
/*! MBUS_M2 - M-Bus M2 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M2(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M2_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M2_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M3_MASK          (0xC0U)
#define SYSCON0_AHBMATPRIO_MBUS_M3_SHIFT         (6U)
/*! MBUS_M3 - M-Bus M3 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M3(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M3_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M3_MASK)

