Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_AHBMATPRIO_MBUS_M4_MASK          (0x300U)
#define SYSCON0_AHBMATPRIO_MBUS_M4_SHIFT         (8U)
/*! MBUS_M4 - M-Bus M4 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M4(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M4_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M4_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M5_MASK          (0xC00U)
#define SYSCON0_AHBMATPRIO_MBUS_M5_SHIFT         (10U)
/*! MBUS_M5 - M-Bus M5 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M5(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M5_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M5_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M6_MASK          (0x3000U)
#define SYSCON0_AHBMATPRIO_MBUS_M6_SHIFT         (12U)
/*! MBUS_M6 - M-Bus M6 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M6(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M6_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M6_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M7_MASK          (0xC000U)
#define SYSCON0_AHBMATPRIO_MBUS_M7_SHIFT         (14U)
/*! MBUS_M7 - M-Bus M7 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M7(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M7_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M7_MASK)

#define SYSCON0_AHBMATPRIO_MBUS_M8_MASK          (0x30000U)
#define SYSCON0_AHBMATPRIO_MBUS_M8_SHIFT         (16U)
/*! MBUS_M8 - M-Bus M8 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_MBUS_M8(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_MBUS_M8_SHIFT)) & SYSCON0_AHBMATPRIO_MBUS_M8_MASK)

#define SYSCON0_AHBMATPRIO_PBUS_M0_MASK          (0x3000000U)
#define SYSCON0_AHBMATPRIO_PBUS_M0_SHIFT         (24U)
/*! PBUS_M0 - P-Bus M0 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_PBUS_M0(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_PBUS_M0_SHIFT)) & SYSCON0_AHBMATPRIO_PBUS_M0_MASK)

#define SYSCON0_AHBMATPRIO_PBUS_M1_MASK          (0xC000000U)
#define SYSCON0_AHBMATPRIO_PBUS_M1_SHIFT         (26U)
/*! PBUS_M1 - P-Bus M1 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_PBUS_M1(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_PBUS_M1_SHIFT)) & SYSCON0_AHBMATPRIO_PBUS_M1_MASK)

#define SYSCON0_AHBMATPRIO_PBUS_M2_MASK          (0x30000000U)
#define SYSCON0_AHBMATPRIO_PBUS_M2_SHIFT         (28U)
/*! PBUS_M2 - P-Bus M2 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_PBUS_M2(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_PBUS_M2_SHIFT)) & SYSCON0_AHBMATPRIO_PBUS_M2_MASK)

#define SYSCON0_AHBMATPRIO_PBUS_M3_MASK          (0xC0000000U)
#define SYSCON0_AHBMATPRIO_PBUS_M3_SHIFT         (30U)
/*! PBUS_M3 - P-Bus M3 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON0_AHBMATPRIO_PBUS_M3(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_AHBMATPRIO_PBUS_M3_SHIFT)) & SYSCON0_AHBMATPRIO_PBUS_M3_MASK)
/*! @} */

/*! @name RXEVPULSEGEN - Receive Event Pulse Generator */
/*! @{ */

#define SYSCON0_RXEVPULSEGEN_RXEVPULSEGEN_MASK   (0x1U)
#define SYSCON0_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT  (0U)
/*! RXEVPULSEGEN - Receive Event Pulse Generator
 *  0b0..No effect
 *  0b1..Pulse receive event high for one cycle
 */
#define SYSCON0_RXEVPULSEGEN_RXEVPULSEGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT)) & SYSCON0_RXEVPULSEGEN_RXEVPULSEGEN_MASK)
/*! @} */

/*! @name LATCHED_CM33_TXEV - Latched Cortex-M33 Transmit Event */
/*! @{ */

#define SYSCON0_LATCHED_CM33_TXEV_LATCHED_TXEV_MASK (0x1U)
#define SYSCON0_LATCHED_CM33_TXEV_LATCHED_TXEV_SHIFT (0U)
/*! LATCHED_TXEV - Cortex-M33 Transmit Event
 *  0b0..No effect
 *  0b1..Clear the event flag
 */
#define SYSCON0_LATCHED_CM33_TXEV_LATCHED_TXEV(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_LATCHED_CM33_TXEV_LATCHED_TXEV_SHIFT)) & SYSCON0_LATCHED_CM33_TXEV_LATCHED_TXEV_MASK)
/*! @} */

/*! @name SYSTEM_STICK_CALIB - System Secure Tick Calibration */
/*! @{ */

#define SYSCON0_SYSTEM_STICK_CALIB_TENMS_MASK    (0xFFFFFFU)
#define SYSCON0_SYSTEM_STICK_CALIB_TENMS_SHIFT   (0U)
/*! TENMS - Ten Milliseconds */
#define SYSCON0_SYSTEM_STICK_CALIB_TENMS(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_SYSTEM_STICK_CALIB_TENMS_SHIFT)) & SYSCON0_SYSTEM_STICK_CALIB_TENMS_MASK)

#define SYSCON0_SYSTEM_STICK_CALIB_SKEW_MASK     (0x1000000U)
#define SYSCON0_SYSTEM_STICK_CALIB_SKEW_SHIFT    (24U)
/*! SKEW - Skew
 *  0b0..Exact
 *  0b1..Inexact, or not given
 */
#define SYSCON0_SYSTEM_STICK_CALIB_SKEW(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_SYSTEM_STICK_CALIB_SKEW_SHIFT)) & SYSCON0_SYSTEM_STICK_CALIB_SKEW_MASK)

#define SYSCON0_SYSTEM_STICK_CALIB_NOREF_MASK    (0x2000000U)
#define SYSCON0_SYSTEM_STICK_CALIB_NOREF_SHIFT   (25U)
/*! NOREF - No Reference Clock
 *  0b0..Provides
 *  0b1..Not provide
 */
#define SYSCON0_SYSTEM_STICK_CALIB_NOREF(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_SYSTEM_STICK_CALIB_NOREF_SHIFT)) & SYSCON0_SYSTEM_STICK_CALIB_NOREF_MASK)
/*! @} */

/*! @name SYSTEM_NSTICK_CALIB - System Non-Secure Tick Calibration */
/*! @{ */

#define SYSCON0_SYSTEM_NSTICK_CALIB_TENMS_MASK   (0xFFFFFFU)
#define SYSCON0_SYSTEM_NSTICK_CALIB_TENMS_SHIFT  (0U)
/*! TENMS - Ten Milliseconds */
#define SYSCON0_SYSTEM_NSTICK_CALIB_TENMS(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_SYSTEM_NSTICK_CALIB_TENMS_SHIFT)) & SYSCON0_SYSTEM_NSTICK_CALIB_TENMS_MASK)

#define SYSCON0_SYSTEM_NSTICK_CALIB_SKEW_MASK    (0x1000000U)
#define SYSCON0_SYSTEM_NSTICK_CALIB_SKEW_SHIFT   (24U)
/*! SKEW - Skew
 *  0b0..Exact
 *  0b1..Inexact, or not given
 */
#define SYSCON0_SYSTEM_NSTICK_CALIB_SKEW(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_SYSTEM_NSTICK_CALIB_SKEW_SHIFT)) & SYSCON0_SYSTEM_NSTICK_CALIB_SKEW_MASK)

#define SYSCON0_SYSTEM_NSTICK_CALIB_NOREF_MASK   (0x2000000U)
#define SYSCON0_SYSTEM_NSTICK_CALIB_NOREF_SHIFT  (25U)
/*! NOREF - No Reference Clock
 *  0b0..Provides
 *  0b1..Not provide
 */
#define SYSCON0_SYSTEM_NSTICK_CALIB_NOREF(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_SYSTEM_NSTICK_CALIB_NOREF_SHIFT)) & SYSCON0_SYSTEM_NSTICK_CALIB_NOREF_MASK)
/*! @} */

/*! @name CPU0_STATUS - CPU0 Status */
/*! @{ */

