Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_CPU0_STATUS_CPU0_LOCKUP_MASK     (0x1U)
#define SYSCON0_CPU0_STATUS_CPU0_LOCKUP_SHIFT    (0U)
/*! CPU0_LOCKUP - CPU0 Lockup State
 *  0b0..Not in lockup
 *  0b1..In lockup
 */
#define SYSCON0_CPU0_STATUS_CPU0_LOCKUP(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_CPU0_STATUS_CPU0_LOCKUP_SHIFT)) & SYSCON0_CPU0_STATUS_CPU0_LOCKUP_MASK)
/*! @} */

/*! @name GPIO_PSYNC - GPIO Synchronization Stages */
/*! @{ */

#define SYSCON0_GPIO_PSYNC_PSYNC_MASK            (0x1U)
#define SYSCON0_GPIO_PSYNC_PSYNC_SHIFT           (0U)
/*! PSYNC - Synchronization Stage Setting
 *  0b0..2-stage sync
 *  0b1..1-stage sync
 */
#define SYSCON0_GPIO_PSYNC_PSYNC(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON0_GPIO_PSYNC_PSYNC_SHIFT)) & SYSCON0_GPIO_PSYNC_PSYNC_MASK)
/*! @} */

/*! @name AUTOCLKGATEOVERRIDE0 - Automatic Clock Gate Override */
/*! @{ */

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION0_MASK (0x1U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION0_SHIFT (0U)
/*! PARTITION0 - Partition 0
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION0_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION0_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION1_MASK (0x2U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION1_SHIFT (1U)
/*! PARTITION1 - Partition 1
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION1_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION1_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION2_MASK (0x4U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION2_SHIFT (2U)
/*! PARTITION2 - Partition 2
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION2_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION2_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION3_MASK (0x8U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION3_SHIFT (3U)
/*! PARTITION3 - Partition 3
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION3(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION3_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION3_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION4_MASK (0x10U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION4_SHIFT (4U)
/*! PARTITION4 - Partition 4
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION4(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION4_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION4_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION5_MASK (0x20U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION5_SHIFT (5U)
/*! PARTITION5 - Partition 5
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION5(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION5_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION5_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION6_MASK (0x40U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION6_SHIFT (6U)
/*! PARTITION6 - Partition 6
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION6(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION6_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION6_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION7_MASK (0x80U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION7_SHIFT (7U)
/*! PARTITION7 - Partition 7
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION7(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION7_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION7_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION8_MASK (0x100U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION8_SHIFT (8U)
/*! PARTITION8 - Partition 8
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION8(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION8_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION8_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION9_MASK (0x200U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION9_SHIFT (9U)
/*! PARTITION9 - Partition 9
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION9(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION9_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION9_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION10_MASK (0x400U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION10_SHIFT (10U)
/*! PARTITION10 - Partition 10
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION10(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION10_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION10_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION11_MASK (0x800U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION11_SHIFT (11U)
/*! PARTITION11 - Partition 11
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION11(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION11_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION11_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION12_MASK (0x1000U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION12_SHIFT (12U)
/*! PARTITION12 - Partition 12
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION12(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION12_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION12_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION13_MASK (0x2000U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION13_SHIFT (13U)
/*! PARTITION13 - Partition 13
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION13(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION13_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION13_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION14_MASK (0x4000U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION14_SHIFT (14U)
/*! PARTITION14 - Partition 14
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION14(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION14_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION14_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION15_MASK (0x8000U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION15_SHIFT (15U)
/*! PARTITION15 - Partition 15
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION15(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION15_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION15_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION16_MASK (0x10000U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION16_SHIFT (16U)
/*! PARTITION16 - Partition 16
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION16(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION16_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION16_MASK)

#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION17_MASK (0x20000U)
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION17_SHIFT (17U)
/*! PARTITION17 - Partition 17
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION17(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION17_SHIFT)) & SYSCON0_AUTOCLKGATEOVERRIDE0_PARTITION17_MASK)
/*! @} */

/*! @name SRAM_CLKGATE_CTRL - SRAM Clock Gating Control */
/*! @{ */

