Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
/*! @name XSPI1_MEM_CTRL - XSPI1 Memory Control */
/*! @{ */

#define SYSCON0_XSPI1_MEM_CTRL_MEM_STDBY_MASK    (0x80U)
#define SYSCON0_XSPI1_MEM_CTRL_MEM_STDBY_SHIFT   (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_MEM_CTRL_MEM_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_XSPI1_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_XSPI1_MEM_CTRL_MEM_WIG_MASK      (0x100U)
#define SYSCON0_XSPI1_MEM_CTRL_MEM_WIG_SHIFT     (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_MEM_CTRL_MEM_WIG(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON0_XSPI1_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON0_XSPI1_MEM_CTRL_MEM_RIG_MASK      (0x200U)
#define SYSCON0_XSPI1_MEM_CTRL_MEM_RIG_SHIFT     (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_MEM_CTRL_MEM_RIG(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON0_XSPI1_MEM_CTRL_MEM_RIG_MASK)
/*! @} */

/*! @name XSPI0_DATA_MEM_CTRL - CACHE64_CTRL0 Data Memory Control */
/*! @{ */

#define SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_STDBY_MASK (0x80U)
#define SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_STDBY_SHIFT (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_STDBY(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_IG_MASK  (0x100U)
#define SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_IG_SHIFT (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_IG(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_XSPI0_DATA_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name XSPI1_DATA_MEM_CTRL - CACHE64_CTRL1 Data Memory Control */
/*! @{ */

#define SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_STDBY_MASK (0x80U)
#define SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_STDBY_SHIFT (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_STDBY(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_IG_MASK  (0x100U)
#define SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_IG_SHIFT (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_IG(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_XSPI1_DATA_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name NPU_MEM_CTRL - NPU Memory Control */
/*! @{ */

#define SYSCON0_NPU_MEM_CTRL_PWR_STDBY_MASK      (0x80U)
#define SYSCON0_NPU_MEM_CTRL_PWR_STDBY_SHIFT     (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_NPU_MEM_CTRL_PWR_STDBY(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_NPU_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_NPU_MEM_CTRL_PWR_STDBY_MASK)

#define SYSCON0_NPU_MEM_CTRL_PWR_IG_MASK         (0x100U)
#define SYSCON0_NPU_MEM_CTRL_PWR_IG_SHIFT        (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_NPU_MEM_CTRL_PWR_IG(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON0_NPU_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON0_NPU_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name PKC0_MEM_CTRL - PKC Memory 0 Control */
/*! @{ */

#define SYSCON0_PKC0_MEM_CTRL_PWR_STDBY_MASK     (0x80U)
#define SYSCON0_PKC0_MEM_CTRL_PWR_STDBY_SHIFT    (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_PKC0_MEM_CTRL_PWR_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_PKC0_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_PKC0_MEM_CTRL_PWR_STDBY_MASK)

#define SYSCON0_PKC0_MEM_CTRL_PWR_IG_MASK        (0x100U)
#define SYSCON0_PKC0_MEM_CTRL_PWR_IG_SHIFT       (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_PKC0_MEM_CTRL_PWR_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_PKC0_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON0_PKC0_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name PKC1_MEM_CTRL - PKC Memory 1 Control */
/*! @{ */

#define SYSCON0_PKC1_MEM_CTRL_PWR_STDBY_MASK     (0x80U)
#define SYSCON0_PKC1_MEM_CTRL_PWR_STDBY_SHIFT    (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_PKC1_MEM_CTRL_PWR_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_PKC1_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_PKC1_MEM_CTRL_PWR_STDBY_MASK)

#define SYSCON0_PKC1_MEM_CTRL_PWR_IG_MASK        (0x100U)
#define SYSCON0_PKC1_MEM_CTRL_PWR_IG_SHIFT       (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_PKC1_MEM_CTRL_PWR_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_PKC1_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON0_PKC1_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name CM33_MEM_DATA_CTRL - CPU0 Memory Data Control */
/*! @{ */

#define SYSCON0_CM33_MEM_DATA_CTRL_PWR_STDBY_MASK (0x80U)
#define SYSCON0_CM33_MEM_DATA_CTRL_PWR_STDBY_SHIFT (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_CM33_MEM_DATA_CTRL_PWR_STDBY(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_CM33_MEM_DATA_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_CM33_MEM_DATA_CTRL_PWR_STDBY_MASK)

#define SYSCON0_CM33_MEM_DATA_CTRL_PWR_IG_MASK   (0x100U)
#define SYSCON0_CM33_MEM_DATA_CTRL_PWR_IG_SHIFT  (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_CM33_MEM_DATA_CTRL_PWR_IG(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_CM33_MEM_DATA_CTRL_PWR_IG_SHIFT)) & SYSCON0_CM33_MEM_DATA_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name CM33_MEM_TAG_CTRL - CPU0 Memory Tag Control */
/*! @{ */

#define SYSCON0_CM33_MEM_TAG_CTRL_PWR_STDBY_MASK (0x80U)
#define SYSCON0_CM33_MEM_TAG_CTRL_PWR_STDBY_SHIFT (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_CM33_MEM_TAG_CTRL_PWR_STDBY(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_CM33_MEM_TAG_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_CM33_MEM_TAG_CTRL_PWR_STDBY_MASK)

#define SYSCON0_CM33_MEM_TAG_CTRL_PWR_IG_MASK    (0x100U)
#define SYSCON0_CM33_MEM_TAG_CTRL_PWR_IG_SHIFT   (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_CM33_MEM_TAG_CTRL_PWR_IG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_CM33_MEM_TAG_CTRL_PWR_IG_SHIFT)) & SYSCON0_CM33_MEM_TAG_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name HIFI4_MEM_CTL - HiFi4 Memory Control */
/*! @{ */

#define SYSCON0_HIFI4_MEM_CTL_MEM_STDBY_MASK     (0x80U)
#define SYSCON0_HIFI4_MEM_CTL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_HIFI4_MEM_CTL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_MEM_CTL_MEM_STDBY_SHIFT)) & SYSCON0_HIFI4_MEM_CTL_MEM_STDBY_MASK)

