Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA0_EN0_CTIMER0_M0_EN_MASK     (0x10000U)
#define SYSCON0_EDMA0_EN0_CTIMER0_M0_EN_SHIFT    (16U)
/*! CTIMER0_M0_EN - CTIMER0 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER0_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER0_M0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER0_M0_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER0_M1_EN_MASK     (0x20000U)
#define SYSCON0_EDMA0_EN0_CTIMER0_M1_EN_SHIFT    (17U)
/*! CTIMER0_M1_EN - CTIMER0 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER0_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER0_M1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER0_M1_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER1_M0_EN_MASK     (0x40000U)
#define SYSCON0_EDMA0_EN0_CTIMER1_M0_EN_SHIFT    (18U)
/*! CTIMER1_M0_EN - CTIMER1 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER1_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER1_M0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER1_M0_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER1_M1_EN_MASK     (0x80000U)
#define SYSCON0_EDMA0_EN0_CTIMER1_M1_EN_SHIFT    (19U)
/*! CTIMER1_M1_EN - CTIMER1 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER1_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER1_M1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER1_M1_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER2_M0_EN_MASK     (0x100000U)
#define SYSCON0_EDMA0_EN0_CTIMER2_M0_EN_SHIFT    (20U)
/*! CTIMER2_M0_EN - CTIMER2 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER2_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER2_M0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER2_M0_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER2_M1_EN_MASK     (0x200000U)
#define SYSCON0_EDMA0_EN0_CTIMER2_M1_EN_SHIFT    (21U)
/*! CTIMER2_M1_EN - CTIMER2 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER2_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER2_M1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER2_M1_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER3_M0_EN_MASK     (0x400000U)
#define SYSCON0_EDMA0_EN0_CTIMER3_M0_EN_SHIFT    (22U)
/*! CTIMER3_M0_EN - CTIMER3 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER3_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER3_M0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER3_M0_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER3_M1_EN_MASK     (0x800000U)
#define SYSCON0_EDMA0_EN0_CTIMER3_M1_EN_SHIFT    (23U)
/*! CTIMER3_M1_EN - CTIMER3 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER3_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER3_M1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER3_M1_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER4_M0_EN_MASK     (0x1000000U)
#define SYSCON0_EDMA0_EN0_CTIMER4_M0_EN_SHIFT    (24U)
/*! CTIMER4_M0_EN - CTIMER4 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER4_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER4_M0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER4_M0_EN_MASK)

#define SYSCON0_EDMA0_EN0_CTIMER4_M1_EN_MASK     (0x2000000U)
#define SYSCON0_EDMA0_EN0_CTIMER4_M1_EN_SHIFT    (25U)
/*! CTIMER4_M1_EN - CTIMER4 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_CTIMER4_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_CTIMER4_M1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_CTIMER4_M1_EN_MASK)

#define SYSCON0_EDMA0_EN0_SCT0_DMAA_EN_MASK      (0x4000000U)
#define SYSCON0_EDMA0_EN0_SCT0_DMAA_EN_SHIFT     (26U)
/*! SCT0_DMAA_EN - SCT0 DMA A Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_SCT0_DMAA_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_SCT0_DMAA_EN_SHIFT)) & SYSCON0_EDMA0_EN0_SCT0_DMAA_EN_MASK)

#define SYSCON0_EDMA0_EN0_SCT0_DMAB_EN_MASK      (0x8000000U)
#define SYSCON0_EDMA0_EN0_SCT0_DMAB_EN_SHIFT     (27U)
/*! SCT0_DMAB_EN - SCT0 DMA B Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_SCT0_DMAB_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_SCT0_DMAB_EN_SHIFT)) & SYSCON0_EDMA0_EN0_SCT0_DMAB_EN_MASK)

#define SYSCON0_EDMA0_EN0_ADC0_FIFO0_EN_MASK     (0x10000000U)
#define SYSCON0_EDMA0_EN0_ADC0_FIFO0_EN_SHIFT    (28U)
/*! ADC0_FIFO0_EN - ADC0 FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_ADC0_FIFO0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_ADC0_FIFO0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_ADC0_FIFO0_EN_MASK)

#define SYSCON0_EDMA0_EN0_ADC0_FIFO1_EN_MASK     (0x20000000U)
#define SYSCON0_EDMA0_EN0_ADC0_FIFO1_EN_SHIFT    (29U)
/*! ADC0_FIFO1_EN - ADC0 FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_ADC0_FIFO1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_ADC0_FIFO1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_ADC0_FIFO1_EN_MASK)

#define SYSCON0_EDMA0_EN0_SDADC_FIFO0_EN_MASK    (0x40000000U)
#define SYSCON0_EDMA0_EN0_SDADC_FIFO0_EN_SHIFT   (30U)
/*! SDADC_FIFO0_EN - SDADC FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_SDADC_FIFO0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_SDADC_FIFO0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_SDADC_FIFO0_EN_MASK)

#define SYSCON0_EDMA0_EN0_SDADC_FIFO1_EN_MASK    (0x80000000U)
#define SYSCON0_EDMA0_EN0_SDADC_FIFO1_EN_SHIFT   (31U)
/*! SDADC_FIFO1_EN - SDADC FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_SDADC_FIFO1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_SDADC_FIFO1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_SDADC_FIFO1_EN_MASK)
/*! @} */

/*! @name EDMA0_EN1 - eDMA0 Request Enable 1 */
/*! @{ */

#define SYSCON0_EDMA0_EN1_SDADC_FIFO2_EN_MASK    (0x1U)
#define SYSCON0_EDMA0_EN1_SDADC_FIFO2_EN_SHIFT   (0U)
/*! SDADC_FIFO2_EN - SDADC FIFO2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_SDADC_FIFO2_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_SDADC_FIFO2_EN_SHIFT)) & SYSCON0_EDMA0_EN1_SDADC_FIFO2_EN_MASK)

