Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA0_EN2_GPIO1_DMA0_EN_MASK     (0x2000000U)
#define SYSCON0_EDMA0_EN2_GPIO1_DMA0_EN_SHIFT    (25U)
/*! GPIO1_DMA0_EN - GPIO1 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO1_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO1_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO1_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO1_DMA1_EN_MASK     (0x4000000U)
#define SYSCON0_EDMA0_EN2_GPIO1_DMA1_EN_SHIFT    (26U)
/*! GPIO1_DMA1_EN - GPIO1 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO1_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO1_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO1_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO2_DMA0_EN_MASK     (0x8000000U)
#define SYSCON0_EDMA0_EN2_GPIO2_DMA0_EN_SHIFT    (27U)
/*! GPIO2_DMA0_EN - GPIO2 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO2_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO2_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO2_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO2_DMA1_EN_MASK     (0x10000000U)
#define SYSCON0_EDMA0_EN2_GPIO2_DMA1_EN_SHIFT    (28U)
/*! GPIO2_DMA1_EN - GPIO2 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO2_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO2_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO2_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO3_DMA0_EN_MASK     (0x20000000U)
#define SYSCON0_EDMA0_EN2_GPIO3_DMA0_EN_SHIFT    (29U)
/*! GPIO3_DMA0_EN - GPIO3 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO3_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO3_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO3_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO3_DMA1_EN_MASK     (0x40000000U)
#define SYSCON0_EDMA0_EN2_GPIO3_DMA1_EN_SHIFT    (30U)
/*! GPIO3_DMA1_EN - GPIO3 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO3_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO3_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO3_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO4_DMA0_EN_MASK     (0x80000000U)
#define SYSCON0_EDMA0_EN2_GPIO4_DMA0_EN_SHIFT    (31U)
/*! GPIO4_DMA0_EN - GPIO4 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO4_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO4_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO4_DMA0_EN_MASK)
/*! @} */

/*! @name EDMA0_EN3 - eDMA0 Request Enable 3 */
/*! @{ */

#define SYSCON0_EDMA0_EN3_GPIO4_DMA1_EN_MASK     (0x1U)
#define SYSCON0_EDMA0_EN3_GPIO4_DMA1_EN_SHIFT    (0U)
/*! GPIO4_DMA1_EN - GPIO4 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO4_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO4_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO4_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN3_GPIO5_DMA0_EN_MASK     (0x2U)
#define SYSCON0_EDMA0_EN3_GPIO5_DMA0_EN_SHIFT    (1U)
/*! GPIO5_DMA0_EN - GPIO5 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO5_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO5_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO5_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN3_GPIO5_DMA1_EN_MASK     (0x4U)
#define SYSCON0_EDMA0_EN3_GPIO5_DMA1_EN_SHIFT    (2U)
/*! GPIO5_DMA1_EN - GPIO5 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO5_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO5_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO5_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN3_GPIO6_DMA0_EN_MASK     (0x8U)
#define SYSCON0_EDMA0_EN3_GPIO6_DMA0_EN_SHIFT    (3U)
/*! GPIO6_DMA0_EN - GPIO6 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO6_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO6_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO6_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN3_GPIO6_DMA1_EN_MASK     (0x10U)
#define SYSCON0_EDMA0_EN3_GPIO6_DMA1_EN_SHIFT    (4U)
/*! GPIO6_DMA1_EN - GPIO6 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO6_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO6_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO6_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN3_GPIO7_DMA0_EN_MASK     (0x20U)
#define SYSCON0_EDMA0_EN3_GPIO7_DMA0_EN_SHIFT    (5U)
/*! GPIO7_DMA0_EN - GPIO7 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO7_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO7_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO7_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN3_GPIO7_DMA1_EN_MASK     (0x40U)
#define SYSCON0_EDMA0_EN3_GPIO7_DMA1_EN_SHIFT    (6U)
/*! GPIO7_DMA1_EN - GPIO7 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_GPIO7_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_GPIO7_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN3_GPIO7_DMA1_EN_MASK)

#define SYSCON0_EDMA0_EN3_LPI2C15_RX_EN_MASK     (0x80U)
#define SYSCON0_EDMA0_EN3_LPI2C15_RX_EN_SHIFT    (7U)
/*! LPI2C15_RX_EN - LPI2C15 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_LPI2C15_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_LPI2C15_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN3_LPI2C15_RX_EN_MASK)

#define SYSCON0_EDMA0_EN3_LPI2C15_TX_EN_MASK     (0x100U)
#define SYSCON0_EDMA0_EN3_LPI2C15_TX_EN_SHIFT    (8U)
/*! LPI2C15_TX_EN - LPI2C15 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN3_LPI2C15_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN3_LPI2C15_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN3_LPI2C15_TX_EN_MASK)
/*! @} */

/*! @name EDMA1_EN0 - eDMA1 Request Enable 0 */
/*! @{ */

#define SYSCON0_EDMA1_EN0_MICFIL_EN_MASK         (0x2U)
#define SYSCON0_EDMA1_EN0_MICFIL_EN_SHIFT        (1U)
/*! MICFIL_EN - MICFIL Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_MICFIL_EN(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_MICFIL_EN_SHIFT)) & SYSCON0_EDMA1_EN0_MICFIL_EN_MASK)

#define SYSCON0_EDMA1_EN0_XSPI0_RX_EN_MASK       (0x4U)
#define SYSCON0_EDMA1_EN0_XSPI0_RX_EN_SHIFT      (2U)
/*! XSPI0_RX_EN - XSPI0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_XSPI0_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_XSPI0_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN0_XSPI0_RX_EN_MASK)

#define SYSCON0_EDMA1_EN0_XSPI0_TX_EN_MASK       (0x8U)
#define SYSCON0_EDMA1_EN0_XSPI0_TX_EN_SHIFT      (3U)
/*! XSPI0_TX_EN - XSPI0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_XSPI0_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_XSPI0_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN0_XSPI0_TX_EN_MASK)

