Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA1_EN0_XSPI1_RX_EN_MASK       (0x10U)
#define SYSCON0_EDMA1_EN0_XSPI1_RX_EN_SHIFT      (4U)
/*! XSPI1_RX_EN - XSPI1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_XSPI1_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_XSPI1_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN0_XSPI1_RX_EN_MASK)

#define SYSCON0_EDMA1_EN0_XSPI1_TX_EN_MASK       (0x20U)
#define SYSCON0_EDMA1_EN0_XSPI1_TX_EN_SHIFT      (5U)
/*! XSPI1_TX_EN - XSPI1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_XSPI1_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_XSPI1_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN0_XSPI1_TX_EN_MASK)

#define SYSCON0_EDMA1_EN0_XSPI2_RX_EN_MASK       (0x40U)
#define SYSCON0_EDMA1_EN0_XSPI2_RX_EN_SHIFT      (6U)
/*! XSPI2_RX_EN - XSPI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_XSPI2_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_XSPI2_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN0_XSPI2_RX_EN_MASK)

#define SYSCON0_EDMA1_EN0_XSPI2_TX_EN_MASK       (0x80U)
#define SYSCON0_EDMA1_EN0_XSPI2_TX_EN_SHIFT      (7U)
/*! XSPI2_TX_EN - XSPI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_XSPI2_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_XSPI2_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN0_XSPI2_TX_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ0_EN_MASK     (0x100U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ0_EN_SHIFT    (8U)
/*! PINT0_IRQ0_EN - PINT0 Interrupt 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ0_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ1_EN_MASK     (0x200U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ1_EN_SHIFT    (9U)
/*! PINT0_IRQ1_EN - PINT0 Interrupt 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ1_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ2_EN_MASK     (0x400U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ2_EN_SHIFT    (10U)
/*! PINT0_IRQ2_EN - PINT0 Interrupt 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ2_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ2_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ2_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ3_EN_MASK     (0x800U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ3_EN_SHIFT    (11U)
/*! PINT0_IRQ3_EN - PINT0 Interrupt 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ3_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ3_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ3_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ4_EN_MASK     (0x1000U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ4_EN_SHIFT    (12U)
/*! PINT0_IRQ4_EN - PINT0 Interrupt 4 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ4_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ4_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ4_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ5_EN_MASK     (0x2000U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ5_EN_SHIFT    (13U)
/*! PINT0_IRQ5_EN - PINT0 Interrupt 5 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ5_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ5_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ5_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ6_EN_MASK     (0x4000U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ6_EN_SHIFT    (14U)
/*! PINT0_IRQ6_EN - PINT0 Interrupt 6 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ6_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ6_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ6_EN_MASK)

#define SYSCON0_EDMA1_EN0_PINT0_IRQ7_EN_MASK     (0x8000U)
#define SYSCON0_EDMA1_EN0_PINT0_IRQ7_EN_SHIFT    (15U)
/*! PINT0_IRQ7_EN - PINT0 Interrupt 7 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_PINT0_IRQ7_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_PINT0_IRQ7_EN_SHIFT)) & SYSCON0_EDMA1_EN0_PINT0_IRQ7_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER0_M0_EN_MASK     (0x10000U)
#define SYSCON0_EDMA1_EN0_CTIMER0_M0_EN_SHIFT    (16U)
/*! CTIMER0_M0_EN - CTIMER0 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER0_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER0_M0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER0_M0_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER0_M1_EN_MASK     (0x20000U)
#define SYSCON0_EDMA1_EN0_CTIMER0_M1_EN_SHIFT    (17U)
/*! CTIMER0_M1_EN - CTIMER0 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER0_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER0_M1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER0_M1_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER1_M0_EN_MASK     (0x40000U)
#define SYSCON0_EDMA1_EN0_CTIMER1_M0_EN_SHIFT    (18U)
/*! CTIMER1_M0_EN - CTIMER1 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER1_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER1_M0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER1_M0_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER1_M1_EN_MASK     (0x80000U)
#define SYSCON0_EDMA1_EN0_CTIMER1_M1_EN_SHIFT    (19U)
/*! CTIMER1_M1_EN - CTIMER1 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER1_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER1_M1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER1_M1_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER2_M0_EN_MASK     (0x100000U)
#define SYSCON0_EDMA1_EN0_CTIMER2_M0_EN_SHIFT    (20U)
/*! CTIMER2_M0_EN - CTIMER2 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER2_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER2_M0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER2_M0_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER2_M1_EN_MASK     (0x200000U)
#define SYSCON0_EDMA1_EN0_CTIMER2_M1_EN_SHIFT    (21U)
/*! CTIMER2_M1_EN - CTIMER2 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER2_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER2_M1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER2_M1_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER3_M0_EN_MASK     (0x400000U)
#define SYSCON0_EDMA1_EN0_CTIMER3_M0_EN_SHIFT    (22U)
/*! CTIMER3_M0_EN - CTIMER3 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER3_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER3_M0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER3_M0_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER3_M1_EN_MASK     (0x800000U)
#define SYSCON0_EDMA1_EN0_CTIMER3_M1_EN_SHIFT    (23U)
/*! CTIMER3_M1_EN - CTIMER3 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER3_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER3_M1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER3_M1_EN_MASK)

#define SYSCON0_EDMA1_EN0_CTIMER4_M0_EN_MASK     (0x1000000U)
#define SYSCON0_EDMA1_EN0_CTIMER4_M0_EN_SHIFT    (24U)
/*! CTIMER4_M0_EN - CTIMER4 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER4_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER4_M0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER4_M0_EN_MASK)

