Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_MASK (0x8000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_SHIFT (15U)
/*! AXBS_XSPI0_FORCE_RR - AXBS for XSPI0 Force Round-Robin
 *  0b0..Fixed priority arbitration
 *  0b1..Round-robin arbitration
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_MASK (0x10000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_SHIFT (16U)
/*! AXBS_XSPI1_PRIORITY_M0 - AXBS for XSPI1 M0 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_MASK (0x20000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_SHIFT (17U)
/*! AXBS_XSPI1_PRIORITY_M1 - AXBS for XSPI1 M1 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_MASK (0x40000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_SHIFT (18U)
/*! AXBS_XSPI1_PRIORITY_M2 - AXBS for XSPI1 M2 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_MASK (0x80000000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_SHIFT (31U)
/*! AXBS_XSPI1_FORCE_RR - AXBS for XSPI1 Force Round-Robin
 *  0b0..Fixed priority arbitration
 *  0b1..Round-robin arbitration
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_MASK)
/*! @} */

/*! @name I3C_ASYNC_WAKEUP_CTRL - I3C Asynchronous Wake-up Control */
/*! @{ */

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_MASK (0x1U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_SHIFT (0U)
/*! IRQ_EN0 - I3C0 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_MASK (0x2U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_SHIFT (1U)
/*! IRQ_CLR0 - I3C0 Asynchronous Wake-up Interrupt Clear
 *  0b0..Interrupt not cleared
 *  0b1..Interrupt cleared
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_MASK (0x80U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_SHIFT (7U)
/*! IRQ_STATUS0 - I3C0 Asynchronous Wake-up Interrupt Status
 *  0b0..Interrupt not asserted
 *  0b1..Interrupt asserted
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_MASK (0x100U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_SHIFT (8U)
/*! IRQ_EN1 - I3C1 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_MASK (0x200U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_SHIFT (9U)
/*! IRQ_CLR1 - I3C1 Asynchronous Wake-up Interrupt Clear
 *  0b0..Interrupt not cleared
 *  0b1..Interrupt cleared
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_MASK (0x8000U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_SHIFT (15U)
/*! IRQ_STATUS1 - I3C1 Asynchronous Wake-up Interrupt Status
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_MASK)
/*! @} */

/*! @name GRAY_CODE_LSB - Gray to Binary Converter - Gray Code [31:0] */
/*! @{ */

#define SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_MASK (0xFFFFFFFFU)
#define SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_SHIFT (0U)
/*! CODE_GRAY_31_0 - Gray Code [31:0] */
#define SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_SHIFT)) & SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_MASK)
/*! @} */

/*! @name GRAY_CODE_MSB - Gray to Binary Converter - Gray Code [63:32] */
/*! @{ */

#define SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_MASK (0xFFFFFFFFU)
#define SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_SHIFT (0U)
/*! CODE_GRAY_63_32 - Gray Code [63:32] */
#define SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_SHIFT)) & SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_MASK)
/*! @} */

/*! @name BINARY_CODE_LSB - Gray to Binary Converter - Binary Code [31:0] */
/*! @{ */

#define SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_MASK (0xFFFFFFFFU)
#define SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_SHIFT (0U)
/*! CODE_BIN_31_0 - Binary Code [31:0] */
#define SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_SHIFT)) & SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_MASK)
/*! @} */

/*! @name BINARY_CODE_MSB - Gray to Binary Converter - Binary Code [63:32] */
/*! @{ */

#define SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_MASK (0xFFFFFFFFU)
#define SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_SHIFT (0U)
/*! CODE_BIN_63_32 - Binary Code [63:32] */
#define SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_SHIFT)) & SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_MASK)
/*! @} */

