Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
/*! @name SEC_BUSY_STATE - Secure IP Busy State */
/*! @{ */

#define SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_MASK    (0x1U)
#define SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_SHIFT   (0U)
/*! SAFO_BUSY - SAFO-SGI Busy State
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SYSCON0_SEC_BUSY_STATE_SAFO_BUSY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_SHIFT)) & SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_MASK)

#define SYSCON0_SEC_BUSY_STATE_ELS_BUSY_MASK     (0x2U)
#define SYSCON0_SEC_BUSY_STATE_ELS_BUSY_SHIFT    (1U)
/*! ELS_BUSY - ELS Busy State
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SYSCON0_SEC_BUSY_STATE_ELS_BUSY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_BUSY_STATE_ELS_BUSY_SHIFT)) & SYSCON0_SEC_BUSY_STATE_ELS_BUSY_MASK)
/*! @} */

/*! @name ELS_OTP_LC_STATE - Lifecycle State */
/*! @{ */

#define SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_MASK (0xFFU)
#define SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_SHIFT (0U)
/*! OTP_LC_STATE - OTP Lifecycle State */
#define SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_SHIFT)) & SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_MASK)
/*! @} */

/*! @name ELS_OTP_LC_STATE_DP - Lifecycle State */
/*! @{ */

#define SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_MASK (0xFFU)
#define SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_SHIFT (0U)
/*! OTP_LC_STATE_DP - OTP Lifecycle State */
#define SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_SHIFT)) & SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_MASK)
/*! @} */

/*! @name ELS_TEMPORAL_STATE - ELS Temporal State */
/*! @{ */

#define SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_MASK (0xFU)
#define SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_SHIFT (0U)
/*! TEMPORAL_STATE - Temporal State */
#define SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_SHIFT)) & SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_MASK)
/*! @} */

/*! @name ELS_KDF_MASK - Key Derivation Function Mask */
/*! @{ */

#define SYSCON0_ELS_KDF_MASK_KDF_MASK_MASK       (0xFFFFFFFFU)
#define SYSCON0_ELS_KDF_MASK_KDF_MASK_SHIFT      (0U)
/*! KDF_MASK - Key Derivation Function Mask */
#define SYSCON0_ELS_KDF_MASK_KDF_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_KDF_MASK_KDF_MASK_SHIFT)) & SYSCON0_ELS_KDF_MASK_KDF_MASK_MASK)
/*! @} */

/*! @name ELS_BOOT_STATE0 - ELS Boot State 0 */
/*! @{ */

#define SYSCON0_ELS_BOOT_STATE0_BOOT_SRC_MASK    (0x7U)
#define SYSCON0_ELS_BOOT_STATE0_BOOT_SRC_SHIFT   (0U)
/*! BOOT_SRC - Boot Image Source
 *  0b000..XSPI NOR instance 0
 *  0b001..XSPI NOR instance 1
 *  0b010..eMMC instance 0
 *  0b011..eMMC instance 1
 *  0b100..Recovery SPI flash image
 *  0b101..Serial boot image (execute ISP command used)
 *  0b110..XSPI NAND instance 0
 *  0b111..XSPI NAND instance 1
 */
#define SYSCON0_ELS_BOOT_STATE0_BOOT_SRC(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_BOOT_SRC_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_BOOT_SRC_MASK)

#define SYSCON0_ELS_BOOT_STATE0_SB_JUMP_MASK     (0x8U)
#define SYSCON0_ELS_BOOT_STATE0_SB_JUMP_SHIFT    (3U)
/*! SB_JUMP - SB3 Containing SB_JUMP Command
 *  0b0..Fail
 *  0b1..Success
 */
#define SYSCON0_ELS_BOOT_STATE0_SB_JUMP(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_SB_JUMP_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_SB_JUMP_MASK)

#define SYSCON0_ELS_BOOT_STATE0_PSRAM_MASK       (0x30U)
#define SYSCON0_ELS_BOOT_STATE0_PSRAM_SHIFT      (4U)
/*! PSRAM - Image XIP or Copy-to-PSRAM
 *  0b00..PSRAM is disabled
 *  0b01..PSRAM is enabled
 */
#define SYSCON0_ELS_BOOT_STATE0_PSRAM(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_PSRAM_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_PSRAM_MASK)

#define SYSCON0_ELS_BOOT_STATE0_IMAGE_TYP_MASK   (0xC0U)
#define SYSCON0_ELS_BOOT_STATE0_IMAGE_TYP_SHIFT  (6U)
/*! IMAGE_TYP - Image Type
 *  0b00..Signed image (ECDSA)
 *  0b01..CRC image (CRC)
 */
#define SYSCON0_ELS_BOOT_STATE0_IMAGE_TYP(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_IMAGE_TYP_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_IMAGE_TYP_MASK)

#define SYSCON0_ELS_BOOT_STATE0_SB3_IMAGE_MASK   (0x100U)
#define SYSCON0_ELS_BOOT_STATE0_SB3_IMAGE_SHIFT  (8U)
/*! SB3_IMAGE - SB3 Image Receive
 *  0b0..Fail
 *  0b1..Success
 */
#define SYSCON0_ELS_BOOT_STATE0_SB3_IMAGE(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_SB3_IMAGE_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_SB3_IMAGE_MASK)

#define SYSCON0_ELS_BOOT_STATE0_CDI_DEV_KEY_MASK (0x200U)
#define SYSCON0_ELS_BOOT_STATE0_CDI_DEV_KEY_SHIFT (9U)
/*! CDI_DEV_KEY - CDI Based Device Keys for CSR Harvesting
 *  0b0..Fail
 *  0b1..CDI device keys derived
 */
#define SYSCON0_ELS_BOOT_STATE0_CDI_DEV_KEY(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_CDI_DEV_KEY_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_CDI_DEV_KEY_MASK)

#define SYSCON0_ELS_BOOT_STATE0_CDI_COMP_MASK    (0x400U)
#define SYSCON0_ELS_BOOT_STATE0_CDI_COMP_SHIFT   (10U)
/*! CDI_COMP - CDI per DICE Specification
 *  0b0..Fail
 *  0b1..CDI compute done
 */
#define SYSCON0_ELS_BOOT_STATE0_CDI_COMP(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_CDI_COMP_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_CDI_COMP_MASK)

#define SYSCON0_ELS_BOOT_STATE0_TZ_PRESET_DATA_MASK (0x800U)
#define SYSCON0_ELS_BOOT_STATE0_TZ_PRESET_DATA_SHIFT (11U)
/*! TZ_PRESET_DATA - TrustZone Preset Data
 *  0b0..Fail
 *  0b1..TrustZone preset data loaded
 */
#define SYSCON0_ELS_BOOT_STATE0_TZ_PRESET_DATA(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_TZ_PRESET_DATA_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_TZ_PRESET_DATA_MASK)

#define SYSCON0_ELS_BOOT_STATE0_DEBUG_AUTH_MASK  (0x1000U)
#define SYSCON0_ELS_BOOT_STATE0_DEBUG_AUTH_SHIFT (12U)
/*! DEBUG_AUTH - Debug Authentication
 *  0b0..Fail
 *  0b1..Debug authentication done
 */
#define SYSCON0_ELS_BOOT_STATE0_DEBUG_AUTH(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_DEBUG_AUTH_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_DEBUG_AUTH_MASK)

#define SYSCON0_ELS_BOOT_STATE0_ITRC_ZEROIZE_MASK (0x2000U)
#define SYSCON0_ELS_BOOT_STATE0_ITRC_ZEROIZE_SHIFT (13U)
/*! ITRC_ZEROIZE - ITRC Zeroize Event
 *  0b0..Fail
 *  0b1..ITRC zeroize done
 */
#define SYSCON0_ELS_BOOT_STATE0_ITRC_ZEROIZE(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_ITRC_ZEROIZE_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_ITRC_ZEROIZE_MASK)

#define SYSCON0_ELS_BOOT_STATE0_XSPI0_IPED_EN_MASK (0x4000U)
#define SYSCON0_ELS_BOOT_STATE0_XSPI0_IPED_EN_SHIFT (14U)
/*! XSPI0_IPED_EN - XSPI0 IPED Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_BOOT_STATE0_XSPI0_IPED_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_XSPI0_IPED_EN_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_XSPI0_IPED_EN_MASK)

#define SYSCON0_ELS_BOOT_STATE0_XSPI1_IPED_EN_MASK (0x8000U)
#define SYSCON0_ELS_BOOT_STATE0_XSPI1_IPED_EN_SHIFT (15U)
/*! XSPI1_IPED_EN - XSPI1 IPED Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_BOOT_STATE0_XSPI1_IPED_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_XSPI1_IPED_EN_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_XSPI1_IPED_EN_MASK)

#define SYSCON0_ELS_BOOT_STATE0_BOOT_PIN_STATE_MASK (0x1C00000U)
#define SYSCON0_ELS_BOOT_STATE0_BOOT_PIN_STATE_SHIFT (22U)
/*! BOOT_PIN_STATE - Boot Pin State
 *  0b000..kBootPinSrc_eMMC_uSDHC0
 *  0b001..kBootSrc_XSPI0
 *  0b010..kBootSrc_ISP_AUTO
 *  0b011..kBootSrc_XSPI1
 *  0b100..Boot pin not working
 */
#define SYSCON0_ELS_BOOT_STATE0_BOOT_PIN_STATE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_BOOT_PIN_STATE_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_BOOT_PIN_STATE_MASK)

