Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_BOOT_STATE0_DED_ERR_DET_MASK (0xE000000U)
#define SYSCON0_ELS_BOOT_STATE0_DED_ERR_DET_SHIFT (25U)
/*! DED_ERR_DET - DED Error Detect
 *  0b010..Error detected
 *  0b101..No error
 */
#define SYSCON0_ELS_BOOT_STATE0_DED_ERR_DET(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE0_DED_ERR_DET_SHIFT)) & SYSCON0_ELS_BOOT_STATE0_DED_ERR_DET_MASK)
/*! @} */

/*! @name ELS_BOOT_STATE1 - ELS Boot State 1 */
/*! @{ */

#define SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_MASK (0x3U)
#define SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_SHIFT (0U)
/*! ROOT_KEY_INDEX - Root Key Index */
#define SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_MASK)

#define SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_MASK (0x3FCU)
#define SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_SHIFT (2U)
/*! FIPS_SELF_TEST - FIPS Self-Test
 *  0b00000010..FIPS_SHA_STEN
 *  0b00000011..FIPS_AES_STEN
 *  0b00000100..FIPS_ECDSA_STEN
 *  0b00000101..FIPS_DRBG_STEN
 *  0b00000110..FIPS_HMAC_STEN
 *  0b00000111..FIPS_CKDF_STEN
 *  0b00001000..FIPS_HKDF_STEN
 *  0b00001001..
 */
#define SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_MASK)

#define SYSCON0_ELS_BOOT_STATE1_SB3_TYP_MASK     (0xC00U)
#define SYSCON0_ELS_BOOT_STATE1_SB3_TYP_SHIFT    (10U)
/*! SB3_TYP - SB3 Type
 *  0b00..Customer firmware load and update file
 *  0b01..NXP provisioning firmware
 *  0b10..Customer manufacturing firmware (device HSM)
 */
#define SYSCON0_ELS_BOOT_STATE1_SB3_TYP(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_SB3_TYP_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_SB3_TYP_MASK)

#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_MASK (0x3000U)
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_SHIFT (12U)
/*! PMC0_FLAGS_19_18 - PMC0.FLAGS[19:18] */
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_MASK)

#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_MASK (0x18000U)
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_SHIFT (15U)
/*! PMC0_FLAGS_22_21 - PMC0.FLAGS[22:21] */
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_MASK)

#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_MASK (0xC0000U)
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_SHIFT (18U)
/*! PMC0_FLAGS_17_16 - PMC0.FLAGS[17:16] */
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_MASK)
/*! @} */

/*! @name ELS_BOOT_STATE2 - ELS Boot State 2 */
/*! @{ */

#define SYSCON0_ELS_BOOT_STATE2_VDD_POR_MASK     (0x1U)
#define SYSCON0_ELS_BOOT_STATE2_VDD_POR_SHIFT    (0U)
/*! VDD_POR - VDD POR
 *  0b0..No reset event
 *  0b1..Reset event detected
 */
#define SYSCON0_ELS_BOOT_STATE2_VDD_POR(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE2_VDD_POR_SHIFT)) & SYSCON0_ELS_BOOT_STATE2_VDD_POR_MASK)

#define SYSCON0_ELS_BOOT_STATE2_RESETN_RST_MASK  (0x2U)
#define SYSCON0_ELS_BOOT_STATE2_RESETN_RST_SHIFT (1U)
/*! RESETN_RST - RESETN Reset
 *  0b0..No reset event
 *  0b1..Reset event detected
 */
#define SYSCON0_ELS_BOOT_STATE2_RESETN_RST(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE2_RESETN_RST_SHIFT)) & SYSCON0_ELS_BOOT_STATE2_RESETN_RST_MASK)

#define SYSCON0_ELS_BOOT_STATE2_ISP_AP_RST_MASK  (0x4U)
#define SYSCON0_ELS_BOOT_STATE2_ISP_AP_RST_SHIFT (2U)
/*! ISP_AP_RST - ISP_AP Reset
 *  0b0..No reset event
 *  0b1..Reset event detected
 */
#define SYSCON0_ELS_BOOT_STATE2_ISP_AP_RST(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE2_ISP_AP_RST_SHIFT)) & SYSCON0_ELS_BOOT_STATE2_ISP_AP_RST_MASK)

#define SYSCON0_ELS_BOOT_STATE2_ITRC_SW_RST_MASK (0x8U)
#define SYSCON0_ELS_BOOT_STATE2_ITRC_SW_RST_SHIFT (3U)
/*! ITRC_SW_RST - ITRC_SW Reset
 *  0b0..No reset event
 *  0b1..Reset event detected
 */
#define SYSCON0_ELS_BOOT_STATE2_ITRC_SW_RST(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE2_ITRC_SW_RST_SHIFT)) & SYSCON0_ELS_BOOT_STATE2_ITRC_SW_RST_MASK)
/*! @} */

/*! @name ELS_ASSET_PROT - ELS Asset Protection */
/*! @{ */

#define SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_MASK (0x3U)
#define SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_SHIFT (0U)
/*! ASSET_PROTECTION - Asset Protection
 *  0b01..NOT protected
 *  *..Protected
 */
#define SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_SHIFT)) & SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_MASK)
/*! @} */

/*! @name ELS_AS_UUID - ELS AS UUID */
/*! @{ */

#define SYSCON0_ELS_AS_UUID_UUIDN_MASK           (0xFFFFFFFFU)
#define SYSCON0_ELS_AS_UUID_UUIDN_SHIFT          (0U)
/*! UUIDN - UUIDn 32-Bit Data Register */
#define SYSCON0_ELS_AS_UUID_UUIDN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_UUID_UUIDN_SHIFT)) & SYSCON0_ELS_AS_UUID_UUIDN_MASK)
/*! @} */

/*! @name ELS_AS_CFG0 - ELS AS Configuration 0 */
/*! @{ */

#define SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_MASK    (0xFFU)
#define SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_SHIFT   (0U)
/*! CFG_LC_STATE - Lifecycle State Configuration */
#define SYSCON0_ELS_AS_CFG0_CFG_LC_STATE(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_MASK (0x100U)
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_SHIFT (8U)
/*! CFG_HVD_VDD1_ENABLED - HVD for VDD1 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_MASK (0x200U)
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_SHIFT (9U)
/*! CFG_LVD_VDD1_ENABLED - LVD for VDD1 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_MASK)

