Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_MASK (0x400U)
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_SHIFT (10U)
/*! CFG_HVD_VDD2_ENABLED - HVD for VDD2 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_MASK (0x800U)
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_SHIFT (11U)
/*! CFG_LVD_VDD2_ENABLED - LVD for VDD2 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_MASK (0x1000U)
#define SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_SHIFT (12U)
/*! CFG_VDD2_HGDET0_ENABLED - VDD2 High-Range GDET0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_MASK (0x8000U)
#define SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_SHIFT (15U)
/*! CFG_VDD1_HGDET3_ENABLED - VDD1 High-Range GDET3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_MASK (0x10000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_SHIFT (16U)
/*! CFG_WWDT0_ENABLED - WWDT0 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_MASK (0x20000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_SHIFT (17U)
/*! CFG_WWDT1_ENABLED - WWDT1 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_MASK (0x40000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_SHIFT (18U)
/*! CFG_WWDT2_ENABLED - WWDT2 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_MASK (0x80000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_SHIFT (19U)
/*! CFG_WWDT3_ENABLED - WWDT3 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_MASK (0x100000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_SHIFT (20U)
/*! CFG_CDOG0_ENABLED - CDOG0 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_MASK (0x200000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_SHIFT (21U)
/*! CFG_CDOG1_ENABLED - CDOG1 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_MASK (0x400000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_SHIFT (22U)
/*! CFG_CDOG2_ENABLED - CDOG2 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_MASK (0x800000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_SHIFT (23U)
/*! CFG_CDOG3_ENABLED - CDOG3 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_MASK (0x1000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_SHIFT (24U)
/*! CFG_CDOG4_ENABLED - CDOG4 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_MASK (0x2000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_SHIFT (25U)
/*! CFG_AGLITCH_VDD1_ENABLED - Analog Glitch Detector for VDD1 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_MASK (0x4000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_SHIFT (26U)
/*! CFG_AGLITCH_VDD2_ENABLED - Analog Glitch Detector for VDD2 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_MASK (0x8000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_SHIFT (27U)
/*! CFG_CLKTAMPER_DET_ENABLED - Clock Tamper Detector in OSC32KNP for 32 kHz RTC XTAL Clock
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_MASK (0x10000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_SHIFT (28U)
/*! CFG_PUF_DISABLE_ENROLL - PUF Disable Enroll */
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_MASK (0x20000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_SHIFT (29U)
/*! CFG_PUF_DISABLE_WRAP - PUF Disable Wrap */
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_MASK)
/*! @} */

/*! @name ELS_AS_CFG1 - ELS AS Configuration 1 */
/*! @{ */

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_MASK (0x1U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_SHIFT (0U)
/*! CFG_CSEC_DIS_STRICT_MODE - Disable Strict Mode in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_MASK (0x2U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_SHIFT (1U)
/*! CFG_CSEC_DIS_VIOL_ABORT - Disable Violation Abort in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_MASK (0x4U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_SHIFT (2U)
/*! CFG_CSEC_ENA_NS_PRIV_CHK - Enable Non-Secure Privacy Check in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_MASK (0x8U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_SHIFT (3U)
/*! CFG_CSEC_ENA_S_PRIV_CHK - Enable Secure Privacy Check in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_MASK)

