Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_MASK (0x100000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_SHIFT (20U)
/*! CFG_CPU1_LOCK_S_VTAIRCR - CPU1 Lock Secure VTAIRCR */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_MASK (0x200000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_SHIFT (21U)
/*! CFG_CPU1_LOCK_SAU - CPU1 Lock SAU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_MASK (0x400000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_SHIFT (22U)
/*! CFG_MSEC_DIS_STRICT_MODE - Disable Strict Mode in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_MASK (0x800000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_SHIFT (23U)
/*! CFG_MSEC_DIS_VIOL_ABORT - Disable Violation Abort in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_MASK (0x1000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_SHIFT (24U)
/*! CFG_MSEC_ENA_NS_PRIV_CHK - Enable Non-Secure Privacy Check in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_MASK (0x2000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_SHIFT (25U)
/*! CFG_MSEC_ENA_S_PRIV_CHK - Enable Secure Privacy Check in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_MASK (0x4000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_SHIFT (26U)
/*! CFG_MSEC_ENA_SEC_CHK - Enable Security Check in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_MASK (0x8000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_SHIFT (27U)
/*! CFG_MSEC_IDAU_ALLNS - IDAU All Non-Secure in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_MASK)
/*! @} */

/*! @name ELS_AS_CFG3 - ELS AS Configuration 3 */
/*! @{ */

#define SYSCON0_ELS_AS_CFG3_METAL_VERSION_MASK   (0xF0000U)
#define SYSCON0_ELS_AS_CFG3_METAL_VERSION_SHIFT  (16U)
/*! METAL_VERSION - Metal version */
#define SYSCON0_ELS_AS_CFG3_METAL_VERSION(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_METAL_VERSION_SHIFT)) & SYSCON0_ELS_AS_CFG3_METAL_VERSION_MASK)

#define SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_MASK   (0xF00000U)
#define SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_SHIFT  (20U)
/*! ROM_MINOR_VER - ROM minor version */
#define SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_SHIFT)) & SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_MASK)

#define SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_MASK (0xF000000U)
#define SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_SHIFT (24U)
/*! ROM_PATCH_MFG_VERSION - ROM major version */
#define SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_SHIFT)) & SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_MASK)

#define SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_MASK (0xF0000000U)
#define SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_SHIFT (28U)
/*! PATCH_OTA_VERSION_HEXCODE - Patch version */
#define SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_SHIFT)) & SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_MASK)
/*! @} */

/*! @name ELS_AS_ST0 - ELS AS State 0 */
/*! @{ */

#define SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_MASK (0xFU)
#define SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_SHIFT (0U)
/*! ST_TEMPORAL_STATE - Temporal State */
#define SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_MASK    (0x10U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_SHIFT   (4U)
/*! ST_CPU0_DBGEN - CPU0 Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_MASK    (0x20U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_SHIFT   (5U)
/*! ST_CPU0_NIDEN - CPU0 Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_MASK   (0x40U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_SHIFT  (6U)
/*! ST_CPU0_SPIDEN - CPU0 Secure Privileged Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_MASK  (0x80U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_SHIFT (7U)
/*! ST_CPU0_SPNIDEN - CPU0 Secure Privileged Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_MASK    (0x100U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_SHIFT   (8U)
/*! ST_CPU1_DBGEN - CPU1 Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_MASK    (0x200U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_SHIFT   (9U)
/*! ST_CPU1_NIDEN - CPU1 Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_MASK)

