Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_MASK   (0x400U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_SHIFT  (10U)
/*! ST_CPU1_SPIDEN - CPU1 Secure Privileged Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_MASK  (0x800U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_SHIFT (11U)
/*! ST_CPU1_SPNIDEN - CPU1 Secure Privileged Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_MASK   (0x1000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_SHIFT  (12U)
/*! ST_HIFI4_DBGEN - HiFi4 Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_MASK   (0x2000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_SHIFT  (13U)
/*! ST_HIFI4_NIDEN - HiFi4 Non-Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_MASK   (0x4000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_SHIFT  (14U)
/*! ST_HIFI1_DBGEN - HiFi1 Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_MASK   (0x8000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_SHIFT  (15U)
/*! ST_HIFI1_NIDEN - HiFi1 Non-Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_MASK   (0x10000U)
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_SHIFT  (16U)
/*! ST_AHBAP_DBGEN - Non-Secure Memory Space Access through AHB-AP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_MASK  (0x20000U)
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_SHIFT (17U)
/*! ST_AHBAP_SPIDEN - Secure Memory Space Access through AHB-AP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_MASK    (0x40000U)
#define SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_SHIFT   (18U)
/*! ST_EZHV_DBGEN - EZH-V Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_MASK  (0x80000U)
#define SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_SHIFT (19U)
/*! ST_CORESIGHT_EN - CoreSight Debug Components Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_MASK (0x100000U)
#define SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_SHIFT (20U)
/*! ST_TEST_ACCES_EN - Test Port Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_MASK)
/*! @} */

/*! @name ELS_AS_ST1 - ELS AS State 1 */
/*! @{ */

#define SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_MASK     (0xFU)
#define SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_SHIFT    (0U)
/*! ST_PUF_SCORE - PUF Score State */
#define SYSCON0_ELS_AS_ST1_ST_PUF_SCORE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_MASK)

#define SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_MASK  (0x10U)
#define SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_SHIFT (4U)
/*! ST_PUF_ZEROIZED - PUF Zeroization State */
#define SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_MASK)

#define SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_MASK (0x20U)
#define SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_SHIFT (5U)
/*! ST_MAIN_CLK_IS_EXT - Main Clock Source External */
#define SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_MASK)

#define SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_MASK     (0xC00U)
#define SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_SHIFT    (10U)
/*! ST_BOOT_MODE - Boot Mode Setting */
#define SYSCON0_ELS_AS_ST1_ST_BOOT_MODE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_MASK)
/*! @} */

/*! @name ELS_AS_FLAG0 - ELS AS Flag 0 */
/*! @{ */

#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_MASK (0x1U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_SHIFT (0U)
/*! FLAG_AP_ENABLE_CPU0 - CPU0 AP0 Enable
 *  0b0..No such event
 *  0b1..DAP enables AP0 for CPU0 (Cortex-M33) debug access
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_MASK (0x2U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_SHIFT (1U)
/*! FLAG_AP_ENABLE_CPU1 - CPU1 AP1 Enable
 *  0b0..No such event
 *  0b1..DAP enables AP1 for CPU1 (Cortex-M33) debug access
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_MASK)

