Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_MASK (0x4U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_SHIFT (2U)
/*! FLAG_AHBAP_ENABLE - AHB-AP Enable
 *  0b0..No such event
 *  0b1..DAP enables AHB-AP for memory access through SWD interface
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_MASK (0x8U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_SHIFT (3U)
/*! FLAG_APBAP_ENABLE - APB-AP Enable
 *  0b0..No such event
 *  0b1..DAP enables APB-AP for debug access of HiFi4, HiFi1 or EZH-V
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_MASK (0x10U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_SHIFT (4U)
/*! FLAG_LVD_VDD1_OCCURED - VDD1 LVD Event
 *  0b0..No such event
 *  0b1..LVD from VDD1 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_MASK (0x20U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_SHIFT (5U)
/*! FLAG_HVD_VDD1_OCCURED - VDD1 HVD Event
 *  0b0..No such event
 *  0b1..HVD from VDD1 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_MASK (0x40U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_SHIFT (6U)
/*! FLAG_LVD_VDD2_OCCURED - VDD2 LVD Event
 *  0b0..No such event
 *  0b1..LVD from VDD2 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_MASK (0x80U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_SHIFT (7U)
/*! FLAG_HVD_VDD2_OCCURED - VDD2 HVD Event
 *  0b0..No such event
 *  0b1..HVD from VDD2 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_MASK (0x1000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_SHIFT (12U)
/*! FLAG_PUF_ERROR - PUF Error
 *  0b0..No such event
 *  0b1..Error is flagged from PUF block
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_MASK (0x2000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_SHIFT (13U)
/*! FLAG_GDET_GLITCH_VDD1_DETECTED - VDD1 aGDET Glitch Detected
 *  0b0..No such event
 *  0b1..aGDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_MASK (0x4000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_SHIFT (14U)
/*! FLAG_GDET_GLITCH_VDD2_DETECTED - VDD2 aGDET Glitch Detected
 *  0b0..No such event
 *  0b1..aGDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_MASK (0x8000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_SHIFT (15U)
/*! FLAG_ANA_GLITCH_VDD1_DETECTED - VDD1 Analog Glitch Detected
 *  0b0..No such event
 *  0b1..Analog GDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_MASK (0x10000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_SHIFT (16U)
/*! FLAG_ANA_GLITCH_VDD2_DETECTED - VDD2 Analog Glitch Detected
 *  0b0..No such event
 *  0b1..Analog GDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_MASK (0x20000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_SHIFT (17U)
/*! FLAG_CSEC_VIOL_IRQ_OCURRED - Security Violation Interrupt in VDD2_COMP Domain
 *  0b0..No such event
 *  0b1..Security violation is indicated from AHBSC0
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_MASK (0x40000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_SHIFT (18U)
/*! FLAG_SSEC_VIOL_IRQ_OCURRED - Security Violation Interrupt in VDD1_SENSE Domain
 *  0b0..No such event
 *  0b1..Security violation is indicated from AHBSC3
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_MASK (0x80000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_SHIFT (19U)
/*! FLAG_MSEC_VIOL_IRQ_OCURRED - Security Violation Interrupt in VDD2_MEDIA
 *  0b0..No such event
 *  0b1..Security violation is indicated from AHBSC4
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_MASK (0x100000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_SHIFT (20U)
/*! FLAG_CPU0_NS_C_ACC_OCCURED - CPU0 Non-Secure Code Access
 *  0b0..No such event
 *  0b1..CPU0 (Cortex-M33) makes non-secure code transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_MASK)

