Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_MASK (0x200000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_SHIFT (21U)
/*! FLAG_CPU0_NS_D_ACC_OCCURED - CPU0 Non-Secure Data Access
 *  0b0..No such event
 *  0b1..CPU0 (Cortex-M33) makes non-secure data transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_MASK (0x400000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_SHIFT (22U)
/*! FLAG_CPU1_NS_C_ACC_OCCURED - CPU1 Non-Secure Code Access
 *  0b0..No such event
 *  0b1..CPU1 (Cortex-M33) makes non-secure code transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_MASK (0x800000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_SHIFT (23U)
/*! FLAG_CPU1_NS_D_ACC_OCCURED - CPU1 Non-Secure Data Access
 *  0b0..No such event
 *  0b1..CPU1 (Cortex-M33) makes non-secure data transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_MASK (0x1000000U)
#define SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_SHIFT (24U)
/*! OTPC_EFUSE_O_ATTACK_DETECT - OTPC E-Fuse Output Attack Detect */
#define SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_SHIFT)) & SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_MASK (0x2000000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_SHIFT (25U)
/*! FLAG_CLKTAMPER_DET_IRQ_OCCURED - Clock Tamper Flag
 *  0b0..No detected
 *  0b1..Detected
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_MASK (0x4000000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_SHIFT (26U)
/*! FLAG_TEMPTAMPER_DET_IRQ_OCCURED - Temperature Tamper Flag
 *  0b0..No detected
 *  0b1..Detected
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_MASK)
/*! @} */

/*! @name ELS_AS_FLAG1 - ELS AS Flag 1 */
/*! @{ */

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_RESET_OCCURED_MASK (0x1U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_RESET_OCCURED_SHIFT (0U)
/*! FLAG_WWDT0_RESET_OCCURED - WWDT0 Reset
 *  0b0..No such event
 *  0b1..WWDT0 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_RESET_OCCURED_MASK (0x2U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_RESET_OCCURED_SHIFT (1U)
/*! FLAG_WWDT1_RESET_OCCURED - WWDT1 Reset
 *  0b0..No such event
 *  0b1..WWDT1 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_RESET_OCCURED_MASK (0x4U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_RESET_OCCURED_SHIFT (2U)
/*! FLAG_WWDT2_RESET_OCCURED - WWDT2 Reset
 *  0b0..No such event
 *  0b1..WWDT2 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_RESET_OCCURED_MASK (0x8U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_RESET_OCCURED_SHIFT (3U)
/*! FLAG_WWDT3_RESET_OCCURED - WWDT3 Reset
 *  0b0..No such event
 *  0b1..WWDT3 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_RESET_OCCURED_MASK (0x10U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_RESET_OCCURED_SHIFT (4U)
/*! FLAG_CDOG0_RESET_OCCURED - CDOG0 Reset
 *  0b0..No such event
 *  0b1..CDOG0 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_RESET_OCCURED_MASK (0x20U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_RESET_OCCURED_SHIFT (5U)
/*! FLAG_CDOG1_RESET_OCCURED - CDOG1 Reset
 *  0b0..No such event
 *  0b1..CDOG1 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_RESET_OCCURED_MASK (0x40U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_RESET_OCCURED_SHIFT (6U)
/*! FLAG_CDOG2_RESET_OCCURED - CDOG2 Reset
 *  0b0..No such event
 *  0b1..CDOG2 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_RESET_OCCURED_MASK (0x80U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_RESET_OCCURED_SHIFT (7U)
/*! FLAG_CDOG3_RESET_OCCURED - CDOG3 Reset
 *  0b0..No such event
 *  0b1..CDOG3 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_RESET_OCCURED_MASK (0x100U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_RESET_OCCURED_SHIFT (8U)
/*! FLAG_CDOG4_RESET_OCCURED - CDOG4 Reset
 *  0b0..No such event
 *  0b1..CDOG4 reset is enabled and reset event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_RESET_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_RESET_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_RESET_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_IRQ_OCCURED_MASK (0x200U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_IRQ_OCCURED_SHIFT (9U)
/*! FLAG_WWDT0_IRQ_OCCURED - WWDT0 Interrupt
 *  0b0..No such event
 *  0b1..WWDT0 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT0_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_IRQ_OCCURED_MASK (0x400U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_IRQ_OCCURED_SHIFT (10U)
/*! FLAG_WWDT1_IRQ_OCCURED - WWDT1 Interrupt
 *  0b0..No such event
 *  0b1..WWDT1 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT1_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_IRQ_OCCURED_MASK (0x800U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_IRQ_OCCURED_SHIFT (11U)
/*! FLAG_WWDT2_IRQ_OCCURED - WWDT2 Interrupt
 *  0b0..No such event
 *  0b1..WWDT2 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT2_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_IRQ_OCCURED_MASK (0x1000U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_IRQ_OCCURED_SHIFT (12U)
/*! FLAG_WWDT3_IRQ_OCCURED - WWDT3 Interrupt
 *  0b0..No such event
 *  0b1..WWDT3 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_WWDT3_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_IRQ_OCCURED_MASK (0x2000U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_IRQ_OCCURED_SHIFT (13U)
/*! FLAG_CDOG0_IRQ_OCCURED - CDOG0 Interrupt
 *  0b0..No such event
 *  0b1..CDOG0 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG0_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_IRQ_OCCURED_MASK (0x4000U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_IRQ_OCCURED_SHIFT (14U)
/*! FLAG_CDOG1_IRQ_OCCURED - CDOG1 Interrupt
 *  0b0..No such event
 *  0b1..CDOG1 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG1_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_IRQ_OCCURED_MASK (0x8000U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_IRQ_OCCURED_SHIFT (15U)
/*! FLAG_CDOG2_IRQ_OCCURED - CDOG2 Interrupt
 *  0b0..No such event
 *  0b1..CDOG2 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG2_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_IRQ_OCCURED_MASK (0x10000U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_IRQ_OCCURED_SHIFT (16U)
/*! FLAG_CDOG3_IRQ_OCCURED - CDOG3 Interrupt
 *  0b0..No such event
 *  0b1..CDOG3 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG3_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_IRQ_OCCURED_MASK (0x20000U)
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_IRQ_OCCURED_SHIFT (17U)
/*! FLAG_CDOG4_IRQ_OCCURED - CDOG4 Interrupt
 *  0b0..No such event
 *  0b1..CDOG4 interrupt is enabled and interrupt event is triggered
 */
#define SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG1_FLAG_CDOG4_IRQ_OCCURED_MASK)
/*! @} */

/*! @name CLK_OVERRIDE_RAMPKC - PKC RAM Clock Override */
/*! @{ */

#define SYSCON0_CLK_OVERRIDE_RAMPKC_CLK_OVERRIDE_RAMPKC_MASK (0x1U)
#define SYSCON0_CLK_OVERRIDE_RAMPKC_CLK_OVERRIDE_RAMPKC_SHIFT (0U)
/*! CLK_OVERRIDE_RAMPKC - PKC_RAM_CTRL Clock Override
 *  0b0..Clock gating is not overridden
 *  0b1..Clock gating is overridden (automatic clock gating is disabled)
 */
#define SYSCON0_CLK_OVERRIDE_RAMPKC_CLK_OVERRIDE_RAMPKC(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_CLK_OVERRIDE_RAMPKC_CLK_OVERRIDE_RAMPKC_SHIFT)) & SYSCON0_CLK_OVERRIDE_RAMPKC_CLK_OVERRIDE_RAMPKC_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SYSCON0_Register_Masks */


/*!
 * @}
 */ /* end of group SYSCON0_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SYSCON0_H_ */

